---
kind: method
id: M:Autodesk.Revit.DB.MullionTypeSet.Erase(Autodesk.Revit.DB.MullionType)
source: html/e56c6ee3-090f-e705-008d-c1a862ecc1db.htm
---
# Autodesk.Revit.DB.MullionTypeSet.Erase Method

Removes a specified mullion type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	MullionType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.MullionType`) - The mullion type to be erased.

## Returns
The number of mullion types that were erased from the set.